Repository: aefren/Hibiki
Catalog: adonds-samples/controlType/locale/*/LC_MESSAGES/nvda.po
Languages: fr

source: Say control type before label
fr: Dire le type de contrôle avant son libellé

source: A flexible add-on that allows NVDA to announces the type and state of the GUI controls before their label. The names of types and states can also be customized. The add-on supports checkboxes, radio buttons and checkable menu items. More info on : https://www.rptools.org/access/?p=controltypebeforelabel
fr: Une extension flexible qui permet à NVDA d'annoncer le rôle et l'état des contrôles de l'interface graphique avant leur libellé. Les noms de rôle et d'état peuvent également être personnalisés. L'extension prend en charge les cases à cocher, les boutons radio et les éléments de menu à cocher ou radio. Plus d'infos sur : https://www.rptools.org/access/?p=controltypebeforelabel

source: Attention : Change only the values after the equal symbols
fr: Attention: ne modifiez que les valeurs après les symboles égal

source: Then save and restart NVDA.
fr: Ensuite, enregistrez puis redémarrez NVDA.

source: display settings dialog for the current profile
fr: Affiche le dialogue des Paramètres de formatage des annonces pour le profil courant

source: Edit ini file of states and roles labels
fr: Modifier le fichier ini des libellés d'état et de rôle des contrôles.

source: Default
fr: Défaut

source: Role State Label
fr: Rôle Etat Libellé

source: State Label
fr: Etat Libellé

source: &Say control role and state label by changing their name (better for Braille)
fr: Dire le texte des contrôles en modifiant leur &nom (mieux adapté au Braille)

source: Select the format of the controls below :
fr: Sélectionnez le format des contrôles ci-dessous :

source: &Checkboxes and radio buttons :
fr: &Cases à cocher et boutons radio :

source: Check and radio &Menu items
fr: &Menus à cocher et radio :

source: Error writing file :
fr: Erreur d'enregistrement du fichier :

source: stateBeforeCaption is the old name of controlTypeBeforeLabel. It will be replaced by this new version if you accept otherwise, the installation will be cancelled.
fr: stateBeforeCaption est l'ancien nom de controlTypeBeforeLabel. Elle sera remplacée par cette nouvelle version si vous acceptez sinon l'installation sera annulée.

source: stateBeforeCaption detected
fr: stateBeforeCaption détectée
